USE SOONGSIL_STUDENT_CAFETERIA_SCM;

INSERT INTO NUTRITION (Calories, Protein, Carbohydrates, Fat, Sugar, Sodium)  
VALUES  
(0, 0, 0, 0, 0, 38700),
(255, 11, 64, 3, 0, 20),
(68, 6, 1, 5, 0, 62),
(364, 10, 76, 1, 0, 2),
(395, 11, 70, 5, 4, 600),
(884, 0, 0, 100, 0, 0),
(85, 18, 0, 1, 0, 111),
(242, 27, 0, 14, 0, 65),
(20, 2, 3, 0, 1, 300),
(40, 1, 9, 0, 4, 4),
(76, 8, 2, 4, 0, 8),
(30, 1, 7, 0, 1, 16),
(28, 1, 6, 0, 0, 2),
(149, 6, 33, 0, 1, 17),
(300, 12, 28, 17, 1, 90),
(185, 12, 33, 5, 1, 5000),
(10, 1, 1, 0, 0, 670),
(884, 0, 0, 100, 0, 0),
(239, 27, 0, 14, 0, 82),
(70, 0, 6, 0, 6, 10),
(80, 2, 18, 0, 1, 3),
(343, 0, 85, 0, 0, 3),
(77, 2, 17, 0, 1, 6),
(16, 1, 4, 0, 2, 13),
(100, 5, 12, 7, 1, 10),
(200, 8, 44, 0, 7, 2850),
(37, 2, 7, 1, 1, 7),
(387, 0, 100, 0, 100, 0),
(365, 7, 80, 1, 0, 3),
(402, 25, 1, 33, 1, 621),
(335, 0, 82, 0, 0, 5),
(41, 1, 10, 0, 5, 69),
(884, 0, 0, 100, 0, 0),
(319, 0, 79, 0, 71, 41),
(168, 23, 0, 5, 0, 206),
(680, 1, 1, 75, 1, 635),
(107, 1, 26, 0, 15, 876),
(18, 1, 4, 0, 3, 5),
(82, 2, 13, 0, 9, 680),
(250, 26, 0, 15, 0, 72),
(310, 20, 0, 26, 0, 70),
(65, 1, 11, 0, 9, 850),
(217, 19, 5, 14, 1, 630),
(357, 12, 71, 2, 3, 5),
(16, 2, 3, 0, 2, 10),
(35, 5, 3, 1, 0, 8),
(92, 15, 4, 1, 2, 44),
(42, 3, 5, 1, 5, 44),
(148, 8, 18, 3, 1, 509),
(217, 7, 30, 7, 1, 400),
(180, 5, 25, 7, 2, 500),
(98, 3, 20, 2, 11, 700);

INSERT INTO SUPPLIER (Name, Phone, Address)
VALUES 
('오뚜기', '010-1234-5678', 'Seoul, Gangnam-gu'),
('농협', '010-2345-6789', 'Seoul, Seocho-gu'),
('동원', '010-3456-7890', 'Seoul, Jongno-gu'),
('철수네 수산물', '010-4567-8901', 'Incheon, Bupyeong-gu'),
('비비고', '010-4567-8901', 'Incheon, Bupyeong-gu'),
('용주네 목장', '010-5678-9012', 'Gyeonggi, Suwon-si');

INSERT INTO SUPPLIER_CONTRACT (StartDate, EndDate, SupplierID)
VALUES 
('2023-01-01', '2024-12-31', 1),
('2022-07-01', '2025-06-30', 2),
('2023-05-01', '2024-10-30', 3),
('2023-05-01', '2024-10-30', 4),
('2023-05-01', '2024-10-30', 5),
('2023-05-01', '2024-10-30', 6);

INSERT INTO INGREDIENT (Name, Quantity, Cost, SupplierID, NutritionID, Unit)  
VALUES  
('소금', 50, 30000, 1, 1, 'kg'),  
('후추', 20, 100000, 1, 2, 'kg'),  
('달걀', 360, 100000, 2, 3, '개'),  
('밀가루', 100, 100000, 1, 4, 'kg'),  
('빵가루', 80, 100000, 1, 5, 'kg'),  
('튀김유', 100, 100000, 1, 6, 'L'),  
('새우', 500, 200000, 4, 7, 'kg'),  
('돼지고기', 300, 200000, 6, 8, 'kg'),  
('묵은지', 100, 200000, 1, 9, 'kg'),  
('양파', 200, 200000, 2, 10, 'kg'),  
('두부', 300, 200000, 2, 11, '모'),  
('대파', 150, 200000, 2, 12, 'kg'),  
('청양고추', 50, 200000, 2, 13, 'kg'),  
('다진 마늘', 50, 200000, 2, 14, 'kg'),  
('고춧가루', 50, 200000, 1, 15, 'kg'),  
('된장', 80, 200000, 2, 16, 'kg'),  
('국간장', 100, 200000, 1, 17, 'L'),  
('식용유', 200, 200000, 1, 18, 'L'),  
('닭고기', 300, 200000, 6, 19, 'kg'),  
('맛술', 80, 200000, 1, 20, 'L'),  
('다진 생강', 30, 200000, 2, 21, 'kg'),  
('감자전분', 50, 200000, 1, 22, 'kg'),  
('감자', 200, 200000, 2, 23, 'kg'),  
('배추', 300, 200000, 2, 24, 'kg'),  
('들깨가루', 40, 200000, 1, 25, 'kg'),  
('고추장', 80, 200000, 2, 26, 'kg'),  
('깻잎', 50, 200000, 2, 27, 'kg'),  
('설탕', 100, 200000, 1, 28, 'kg'),  
('쌀', 500, 200000, 2, 29, 'kg'),  
('치즈', 100, 200000, 6, 30, 'kg'),  
('당면', 100, 200000, 1, 31, 'kg'),  
('당근', 150, 200000, 2, 32, 'kg'),  
('참기름', 50, 200000, 1, 33, 'L'),  
('물엿', 80, 200000, 1, 34, 'kg'),  
('참치', 200, 200000, 3, 35, 'kg'),  
('마요네즈', 80, 200000, 1, 36, 'kg'),  
('돈까스 소스', 100, 200000, 1, 37, 'L'),  
('토마토', 150, 200000, 2, 38, 'kg'),  
('토마토 소스', 100, 200000, 1, 39, 'L'),  
('소고기', 300, 300000, 6, 40, 'kg'),  
('차돌박이', 200, 300000, 6, 41, 'kg'),  
('굴소스', 50, 150000, 1, 42, 'L'),  
('떡갈비', 200, 250000, 1, 43, 'kg'),  
('파스타면', 150, 150000, 1, 44, 'kg'),  
('숙주나물', 100, 150000, 2, 45, 'kg'),  
('돈코츠육수', 200, 200000, 1, 46, 'L'),  
('오징어', 150, 150000, 4, 47, 'kg'),  
('우유', 200, 150000, 6, 48, 'L'),  
('어묵', 150, 150000, 4, 49, 'kg'),  
('만두', 300, 200000, 5, 50, 'kg'),  
('미니소떡', 200, 200000, 5, 51, 'kg'),  
('마라소스', 100, 200000, 5, 52, 'L');  

INSERT INTO RECIPE (Name, Instructions)
VALUES 
('새우까스', '1. 새우를 손질한다.
2. 손질한 새우에 소금과 후추를 뿌린 후 10분 정도 재워둔다.
3. 손질한 새우에 밀가루를 골고루 묻혀준다.
4. 달걀 2개를 풀어 계란물을 만든다.
5. 밀가루를 묻힌 새우를 계란물에 담갔다가 빵가루를 고루 묻힌다.
6. 튀김유를 170~180도로 예열한다.
7. 손질한 새우를 넣고 2~3분간 튀긴다.'),
('뚝배기삼겹살김치찌개', '1. 삼겹살, 묵은지, 양파, 두부, 대파, 청양고추를 적당한 크기로 손질한다.
2. 뚝배기에 식용유를 두르고 삼겹살을 넣어 중불에서 볶는5.
3. 소금과 후추로 간을 한다.
4. 삼겹살이 익으면 묵은지를 넣고 고춧가루와 다진 마늘을 넣어 함께 볶는다.
5. 김치가 부드러워질 때까지 3~4분간 볶는다.
6. 물을 뚝배기에 붓고, 된장과 국간장을 넣어 간을 맞춘다.
7. 중불에서 10~15분간 끓인다.
8. 양파와 두부를 넣고 5분간 더 끓인다.
9. 마지막으로 대파와 청양고추를 넣고 1~2분 더 끓인다. '),
('치킨가라아게동', '1. 닭다리살을 손질하고, 간장, 맛술, 다진마늘, 다진 생강, 소금, 후추를 넣고 20분간 재워둔다.
2. 밑간이 끝난 닭고기에 감자전분을 골고루 묻혀준다.
3. 튀김유를 170~180도로 예열한다.
4. 닭고기를 3~4분간 튀겨준다.
5. 한 번 더 1분 정도 튀겨준다.
6. 간장, 맛술, 설탕, 물을 냄비에 넣고 중불에서 끓인다.
7. 따뜻한 밥을 그릇에 담고, 중불에서 끓인 소스를 한두 스푼 뿌린다.
8. 바삭하게 튀긴 치킨 가라아게를 밥 위에 올린다.'),
('치즈돈까스', '1. 돼지고기를 손질하고 소금과 후추로 밑간을 한다.
2. 밑간이 된 돼지고기에 치즈를 넣고 감싸준다.
3. 돼지고기에 밀가루를 묻힌다.
4. 달걀을 풀어 계란물을 만든 후 밀가루를 묻힌 돼지고기를 계란물에 담갔다가 빵가루를 고루 묻힌다.
5. 튀김유를 170~180도로 예열한다.
6. 돼지고기를 넣고 3~4분간 튀긴다.
7. 돈까스 소스와 함께 제공한다.'),
('안동찜닭', '1. 닭을 끓는 물에 2~3분간 데친 후, 불순물을 제거하고 건져낸다.
2. 감자, 당근, 양파, 대파, 청양고추를 썰어 준비한다.
3. 당면을 찬물에 20~30분간 불려준다.
4. 그릇에 간장, 맛술, 다진 마늘, 설탕, 물엿, 고춧가루, 후추, 물을 넣고 잘 섞어준다.
5. 넓은 냄비에 식용유를 두르고, 닭을 넣어 살짝 볶는다.
6. 닭이 겉면만 익으면 그릇에 준비한 소스를 넣고, 감자, 당근을 함께 넣는다.
7. 뚜껑을 덮고 중불에서 15분간 끓인다.
8. 양파, 청양고추를 넣고 5~10분간 더 끓인다.
9. 불린 당면을 넣고 3~5분간 더 조리한다.
10. 참기름과 대파를 넣고 한 번 더 섞어준다.
11. 불을 끄고 접시에 담아낸다.'),
('뼈없는감자탕', '1. 돼지고기를 2~3분간 데쳐 불순물을 제거한다.
2. 배추를 깨끗이 씻고, 끓는 물에 살짝 데친 후 찬물에 헹구고, 먹기 좋은 크기로 썰어준다.
3. 감자는 껍질을 벗기고 큼직하게 썰어 찬물에 담가 전분기를 제거한다.
4. 그릇에 고춧가루, 된장, 고추장, 다진 마늘, 다진 생강, 후추를 넣어 양념장을 준비한다.
5. 물에 돼지고기와 감자를 넣고 10분간 끓이다.
6. 양념장을 넣고, 배추를 추가하여 중불에서 15분간 더 끓인다.
7. 들깨가루, 대파, 청양고추를 넣고 5분간 더 끓인다.
8. 깻잎을 넣고 불을 끈다.'),
('참치마요덮밥', '1. 참치, 마요네즈, 간장, 물엿을 넣고 섞어준다.
2. 밥 위에 섞어둔 참치마요를 올린다.'),
('두부조림', '1. 두부를 썰어서 준비한다.
2. 팬에 식용유를 두르고 두부를 앞뒤로 노릇하게 구워준다.
3. 그릇에 간장, 고춧가루, 다진 마늘, 설탕, 물엿, 물, 후추를 넣고 섞는다.'),
('뚝배기파개장당면사리', '1. 소고기를 데친 후 찬물에 헹군다.
2. 파와 당면을 준비한다.
3. 뚝배기에 물을 붓고 고기를 넣어 끓인다.
4. 파, 당면, 고춧가루, 다진 마늘을 넣고 끓인다.
5. 소금, 후추로 간을 맞춘다.'),
('바베큐치킨덮밥', '1. 닭고기를 손질하여 굴소스, 간장, 다진 마늘로 밑간한다.
2. 팬에 식용유를 두르고 닭고기를 굽는다.
3. 양파를 썰어 함께 볶는다.
4. 밥 위에 구운 닭고기를 올린다.'),
('등심돈까스', '1. 돼지고기를 소금, 후추로 밑간한다.
2. 밀가루, 계란물, 빵가루 순서로 입힌다.
3. 170도 기름에서 노릇하게 튀긴다.
4. 돈까스 소스를 곁들인다.'),
('남도떡갈비조림', '1. 떡갈비를 프라이팬에서 겉면이 노릇해질 때까지 구워준다.
2. 간장, 설탕, 다진 마늘, 참기름으로 양념장을 만든다.
3. 양념장을 넣고 조린다.'),
('차돌짬뽕', '1. 차돌박이를 얇게 썬다.
2. 면을 삶는다.
3. 고추기름에 다진 마늘을 볶는다.
4. 차돌박이와 야채를 넣고 볶는다.
5. 육수를 붓고 끓인다.
6. 삶은 면을 넣고 완성한다.'),
('폭찹스테이크덮밥', '1. 돼지고기를 손질하여 소금, 후추로 밑간한다.
2. 팬에 기름을 두르고 고기를 굽는다.
3. 양파, 당근을 넣고 볶는다.
4. 밥 위에 올려 완성한다.'),
('뚝배기불고기', '1. 소고기를 얇게 썬다.
2. 간장, 설탕, 다진 마늘로 양념한다.
3. 뚝배기에 고기와 양념을 넣고 끓인다.
4. 당면과 야채를 넣고 더 끓인다.'),
('오삼불고기덮밥', '1. 오징어와 삼겹살을 썬다.
2. 고추장, 간장, 다진 마늘로 양념한다.
3. 팬에서 볶는다.
4. 밥 위에 올려 완성한다.'),
('불고기크림파스타꽈배기도너츠', '1. 소고기를 양념해서 볶는다.
2. 파스타면을 삶는다.
3. 우유를 졸여 크림소스를 만든다.
4. 면과 불고기를 크림소스에 볶는다.
5. 밀가루에 소금, 계란, 우유를 넣어 반죽한다.
6. 반죽을 꽈배기 모양으로 만들어 20분간 발효시킨다.
7. 발효시킨 반죽을 170도로 예열한 튀김유에 튀긴다.
8. 불고기크림파스타에 꽈배기 도너츠를 비벼서 완성한다.'),
('돈코츠야사이라멘', '1. 돈코츠육수를 준비한다.
2. 팬에 식용유를 두르고 당근, 숙주나물을 센 불에서 빠르게 볶는다.
3. 소금과 후추로 간한다.
4. 파스타면을 삶는다.
5. 그릇에 면을 담고, 돈코츠 육수를 붓는다.
6. 볶은 야채와 삶은 달걀을 넣고 완성.'),
('닭강정오므라이스', '1. 닭고기를 튀겨 강정소스를 묻힌다.
2. 달걀물을 만든다.
3. 볶음밥을 만든다.
4. 달걀로 볶음밥을 감싼다.
5. 닭강정을 위에 올린다.'),
('새우달걀볶음밥', '1. 새우를 다진다.
2. 달걀을 풀어놓는다.
3. 팬에 기름을 두르고 새우를 볶는다.
4. 밥과 달걀을 넣고 볶는다.
5. 소금, 후추로 간한다.'),
('우삼겹두부찌개', '1. 돼지고기를 썬다.
2. 두부를 깍둑썰기한다.
3. 뚝배기에 육수를 붓고 끓인다.
4. 고기, 두부, 양념을 넣고 끓인다.'),
('대패차슈동', '1. 돼지고기를 얇게 썬다.
2. 간장양념을 만든다.
3. 차슈를 양념에 재운다.
4. 밥 위에 올리고 양념장을 뿌린다.'),
('베이컨토마토파스타미니소떡', '1. 파스타를 삶는다.
2. 돼지고기를 얇게 썰어 양파, 다진 마늘과 함께 식용유에 볶는다.
3. 양파가 투명해지면 토마토와 토마토 소스를 넣고 중약불에서 5분간 끓인다.
4. 소금과 후추로 간을 한다.
5. 삶은 파스타를 넣고 볶는다.
4. 미니소떡을 전자렌지에 돌려서 함께 제공한다.'),
('오삼불고기', '1. 오징어와 삼겹살을 썬다.
2. 고추장, 간장, 다진 마늘로 양념한다.
3. 팬에서 볶는다.'),
('뚝배기어묵김치찌개', '1. 어묵을 썬다.
2. 김치를 썬다.
3. 뚝배기에 물을 붓고 끓인다.
4. 어묵, 김치, 양념을 넣고 끓인다.'),
('안동찜닭덮밥', '1. 닭고기를 손질한다.
2. 간장양념을 만든다.
3. 닭고기를 양념과 함께 조린다.
4. 당면을 넣고 더 조린다.
5. 밥 위에 올린다.'),
('제육덮밥', '1. 돼지고기를 썬다.
2. 고추장 양념을 만든다.
3. 고기를 양념과 함께 볶는다.
4. 밥 위에 올린다.'),
('떡갈비조림', '1. 떡갈비를 준비한다.
2. 간장양념을 만든다.
3. 떡갈비를 굽는다.
4. 양념을 넣고 조린다.'),
('뚝배기만두전골', '1. 만두를 준비한다.
2. 돈코츠 육수를 준비한다.
3. 뚝배기에 육수를 붓고 끓인다.
4. 만두와 당근을 넣고 끓인다.'),
('돈코츠 마라탕', '1. 돈코츠 육수를 준비한다.
2. 마라소스를 넣는다.
3. 돼지고기와 숙주나물을 넣는다.
4. 당면을 넣고 끓인다.');

INSERT INTO RECIPE_INGREDIENT (RecipeID, IngredientID, QuantityRequired)
VALUES 
(1, 7, 0.04),
(1, 1, 0.02),
(1, 2, 0.05),
(1, 3, 0.56),
(1, 4, 0.05),
(1, 5, 0.06),
(1, 6, 0.1),
(2, 8, 0.05),
(2, 9, 0.1),
(2, 10, 0.05),
(2, 11, 0.33),
(2, 12, 0.02),
(2, 13, 0.02),
(2, 14, 0.02),
(2, 15, 0.02),
(2, 16, 0.0375),
(2, 17, 0.03),
(3, 19, 0.05),
(3, 17, 0.02),
(3, 20, 0.025),
(3, 14, 0.02),
(3, 21, 0.017),
(3, 22, 0.04),
(3, 28, 0.01),
(3, 29, 0.04),
(4, 8, 0.05),
(4, 30, 0.03),
(4, 1, 0.02),
(4, 2, 0.05),
(4, 4, 0.05),
(4, 3, 0.56),
(4, 5, 0.06),
(4, 6, 0.1),
(4, 37, 0.03),
(7, 35, 0.05),
(7, 36, 0.0375),
(7, 17, 0.01),
(7, 34, 0.0125),
(7, 29, 0.04),
(23, 44, 0.067),
(23, 8, 0.033),
(23, 10, 0.025),
(23, 14, 0.01),
(23, 18, 0.015),
(23, 38, 0.067),
(23, 39, 0.05),
(23, 1, 0.01),
(23, 2, 0.025),
(23, 51, 0.05),
(30, 46, 0.25),
(30, 52, 0.05),
(30, 8, 0.033),
(30, 45, 0.1),
(30, 31, 0.05),
(5, 19, 0.067),
(5, 17, 0.03),
(5, 14, 0.02),
(5, 28, 0.02),
(5, 34, 0.025),
(5, 15, 0.02),
(5, 31, 0.05),
(5, 33, 0.02),
(6, 8, 0.067),
(6, 23, 0.1),
(6, 24, 0.067),
(6, 15, 0.04),
(6, 16, 0.0375),
(6, 26, 0.0375),
(6, 14, 0.02),
(6, 21, 0.017),
(6, 25, 0.05),
(6, 27, 0.04),
(8, 11, 0.33),
(8, 17, 0.02),
(8, 15, 0.02),
(8, 14, 0.02),
(8, 28, 0.01),
(8, 34, 0.0125),
(9, 40, 0.067),
(9, 12, 0.067),
(9, 31, 0.05),
(9, 15, 0.02),
(9, 14, 0.02),
(9, 1, 0.02),
(9, 2, 0.05),
(10, 19, 0.067),
(10, 42, 0.04),
(10, 17, 0.02),
(10, 14, 0.02),
(10, 10, 0.05),
(10, 29, 0.04),
(11, 8, 0.067),
(11, 1, 0.02),
(11, 2, 0.05),
(11, 4, 0.05),
(11, 3, 0.56),
(11, 5, 0.06),
(11, 6, 0.1),
(11, 37, 0.03),
(12, 43, 0.1),
(12, 17, 0.03),
(12, 28, 0.02),
(12, 14, 0.02),
(12, 33, 0.02),
(13, 41, 0.075),
(13, 44, 0.067),
(13, 14, 0.02),
(13, 10, 0.05),
(13, 32, 0.033),
(14, 8, 0.067),
(14, 1, 0.02),
(14, 2, 0.05),
(14, 10, 0.05),
(14, 32, 0.033),
(14, 29, 0.04),
(15, 40, 0.067),
(15, 17, 0.03),
(15, 28, 0.02),
(15, 14, 0.02),
(15, 31, 0.05),
(16, 47, 0.067),
(16, 8, 0.05),
(16, 26, 0.0375),
(16, 17, 0.02),
(16, 14, 0.02),
(16, 29, 0.04),
(17, 40, 0.05),
(17, 44, 0.067),
(17, 48, 0.15),
(17, 4, 0.1),
(17, 3, 0.28),
(17, 6, 0.1),
(18, 46, 0.25),
(18, 32, 0.033),
(18, 45, 0.1),
(18, 44, 0.067),
(18, 3, 0.28),
(19, 19, 0.067),
(19, 3, 0.83),
(19, 29, 0.04),
(19, 6, 0.1),
(20, 7, 0.04),
(20, 3, 0.56),
(20, 29, 0.04),
(20, 1, 0.02),
(20, 2, 0.05),
(21, 8, 0.067),
(21, 11, 0.33),
(21, 14, 0.02),
(21, 15, 0.02),
(22, 8, 0.067),
(22, 17, 0.03),
(22, 29, 0.04),
(25, 49, 0.067),
(25, 9, 0.1),
(25, 14, 0.02),
(25, 15, 0.02),
(26, 19, 0.067),
(26, 17, 0.03),
(26, 31, 0.05),
(26, 29, 0.04),
(27, 8, 0.067),
(27, 26, 0.0375),
(27, 14, 0.02),
(27, 29, 0.04),
(28, 43, 0.1),
(28, 17, 0.03),
(28, 14, 0.02),
(29, 50, 0.067),
(29, 46, 0.25),
(24, 47, 0.067),
(24, 8, 0.05),
(24, 26, 0.0375),
(24, 17, 0.02),
(24, 14, 0.02),
(29, 32, 0.033);

INSERT INTO MENU (Name, Price, Term, Corner, RecipeID, Date)
VALUES 
('새우까스', 1000, 'Breakfast', 'HotPot', 1, '2024-09-30'),
('뚝배기삼겹살김치찌개', 5000, 'Lunch', 'HotPot', 2, '2024-09-30'),
('치킨가라아게동', 5000, 'Lunch', 'RiceBowl', 3, '2024-09-30'),
('치즈돈까스', 5000, 'Lunch', 'Western', 4, '2024-09-30'),
('안동찜닭', 1000, 'Breakfast', 'HotPot', 5, '2024-10-02'),
('뼈없는감자탕', 5000, 'Lunch', 'HotPot', 6, '2024-10-02'),
('참치마요덮밥', 5000, 'Lunch', 'RiceBowl', 7, '2024-10-02'),
('치즈돈까스', 5000, 'Lunch', 'Western', 4, '2024-10-02'),
('두부조림', 1000, 'Breakfast', 'HotPot', 8, '2024-10-04'),
('뚝배기파개장당면사리', 5000, 'Lunch', 'HotPot', 9, '2024-10-04'),
('바베큐치킨덮밥', 5000, 'Lunch', 'RiceBowl', 10, '2024-10-04'),
('등심돈까스', 5000, 'Lunch', 'Western', 11, '2024-10-04'),
('뚝배기불고기', 1000, 'Breakfast', 'HotPot', 15, '2024-10-07'),
('돈코츠 마라탕', 5000, 'Lunch', 'HotPot', 30, '2024-10-07'),
('제육덮밥', 5000, 'Lunch', 'RiceBowl', 27, '2024-10-07'),
('치즈돈까스', 5000, 'Lunch', 'Western', 4, '2024-10-07'),
('새우까스', 1000, 'Breakfast', 'HotPot', 1, '2024-10-08'),
('뚝배기삼겹살김치찌개', 5000, 'Lunch', 'HotPot', 2, '2024-10-08'),
('치킨가라아게동', 5000, 'Lunch', 'RiceBowl', 3, '2024-10-08'),
('등심돈까스', 5000, 'Lunch', 'Western', 11, '2024-10-08'),
('안동찜닭', 1000, 'Breakfast', 'HotPot', 5, '2024-10-09'),
('뼈없는감자탕', 5000, 'Lunch', 'HotPot', 6, '2024-10-09'),
('참치마요덮밥', 5000, 'Lunch', 'RiceBowl', 7, '2024-10-09'),
('베이컨토마토파스타미니소떡', 5000, 'Lunch', 'Western', 23, '2024-10-09'),
('두부조림', 1000, 'Breakfast', 'HotPot', 8, '2024-10-10'),
('뚝배기파개장당면사리', 5000, 'Lunch', 'HotPot', 9, '2024-10-10'),
('바베큐치킨덮밥', 5000, 'Lunch', 'RiceBowl', 10, '2024-10-10'),
('불고기크림파스타꽈배기도너츠', 5000, 'Lunch', 'Western', 17, '2024-10-10'),
('남도떡갈비조림', 1000, 'Breakfast', 'HotPot', 12, '2024-10-11'),
('차돌짬뽕', 5000, 'Lunch', 'HotPot', 13, '2024-10-11'),
('폭찹스테이크덮밥', 5000, 'Lunch', 'RiceBowl', 14, '2024-10-11'),
('치즈돈까스', 5000, 'Lunch', 'Western', 4, '2024-10-11'),
('남도떡갈비조림', 1000, 'Breakfast', 'HotPot', 12, '2024-10-14'),
('차돌짬뽕', 5000, 'Lunch', 'HotPot', 13, '2024-10-14'),
('폭찹스테이크덮밥', 5000, 'Lunch', 'RiceBowl', 14, '2024-10-14'),
('등심돈까스', 5000, 'Lunch', 'Western', 11, '2024-10-14'),
('두부조림', 1000, 'Breakfast', 'HotPot', 8, '2024-10-15'),
('뚝배기불고기', 5000, 'Lunch', 'HotPot', 15, '2024-10-15'),
('오삼불고기덮밥', 5000, 'Lunch', 'RiceBowl', 16, '2024-10-15'),
('불고기크림파스타꽈배기도너츠', 5000, 'Lunch', 'Western', 17, '2024-10-15'),
('뚝배기불고기', 1000, 'Breakfast', 'HotPot', 15, '2024-10-16'),
('돈코츠야사이라멘', 5000, 'Lunch', 'HotPot', 18, '2024-10-16'),
('닭강정오므라이스', 5000, 'Lunch', 'RiceBowl', 19, '2024-10-16'),
('치즈돈까스', 5000, 'Lunch', 'Western', 4, '2024-10-16'),
('새우달걀볶음밥', 1000, 'Breakfast', 'HotPot', 20, '2024-10-17'),
('우삼겹두부찌개', 5000, 'Lunch', 'HotPot', 21, '2024-10-17'),
('대패차슈동', 5000, 'Lunch', 'RiceBowl', 22, '2024-10-17'),
('베이컨토마토파스타미니소떡', 5000, 'Lunch', 'Western', 23, '2024-10-17'),
('오삼불고기', 1000, 'Breakfast', 'HotPot', 24, '2024-10-18'),
('뚝배기어묵김치찌개', 5000, 'Lunch', 'HotPot', 25, '2024-10-18'),
('안동찜닭덮밥', 5000, 'Lunch', 'RiceBowl', 26, '2024-10-18'),
('치즈돈까스', 5000, 'Lunch', 'Western', 4, '2024-10-18'),
('떡갈비조림', 1000, 'Breakfast', 'HotPot', 28, '2024-10-21'),
('뚝배기만두전골', 5000, 'Lunch', 'HotPot', 29, '2024-10-21'),
('치킨가라아게동', 5000, 'Lunch', 'RiceBowl', 3, '2024-10-21'),
('등심돈까스', 5000, 'Lunch', 'Western', 11, '2024-10-21'),
('제육덮밥', 1000, 'Breakfast', 'HotPot', 27, '2024-10-22'),
('돈코츠 마라탕', 5000, 'Lunch', 'HotPot', 30, '2024-10-22'),
('제육덮밥', 5000, 'Lunch', 'RiceBowl', 27, '2024-10-22'),
('치즈돈까스', 5000, 'Lunch', 'Western', 4, '2024-10-22'),
('두부조림', 1000, 'Breakfast', 'HotPot', 8, '2024-10-23'),
('뚝배기삼겹살김치찌개', 5000, 'Lunch', 'HotPot', 2, '2024-10-23'),
('바베큐치킨덮밥', 5000, 'Lunch', 'RiceBowl', 10, '2024-10-23'),
('등심돈까스', 5000, 'Lunch', 'Western', 11, '2024-10-23'),
('새우까스', 1000, 'Breakfast', 'HotPot', 1, '2024-10-24'),
('뼈없는감자탕', 5000, 'Lunch', 'HotPot', 6, '2024-10-24'),
('오삼불고기덮밥', 5000, 'Lunch', 'RiceBowl', 16, '2024-10-24'),
('치즈돈까스', 5000, 'Lunch', 'Western', 4, '2024-10-24'),
('안동찜닭', 1000, 'Breakfast', 'HotPot', 5, '2024-10-25'),
('차돌짬뽕', 5000, 'Lunch', 'HotPot', 13, '2024-10-25'),
('대패차슈동', 5000, 'Lunch', 'RiceBowl', 22, '2024-10-25'),
('베이컨토마토파스타미니소떡', 5000, 'Lunch', 'Western', 23, '2024-10-25'),
('뚝배기불고기', 1000, 'Breakfast', 'HotPot', 15, '2024-10-28'),
('우삼겹두부찌개', 5000, 'Lunch', 'HotPot', 21, '2024-10-28'),
('치킨가라아게동', 5000, 'Lunch', 'RiceBowl', 3, '2024-10-28'),
('등심돈까스', 5000, 'Lunch', 'Western', 11, '2024-10-28'),
('새우달걀볶음밥', 1000, 'Breakfast', 'HotPot', 20, '2024-10-29'),
('뚝배기만두전골', 5000, 'Lunch', 'HotPot', 29, '2024-10-29'),
('폭찹스테이크덮밥', 5000, 'Lunch', 'RiceBowl', 14, '2024-10-29'),
('치즈돈까스', 5000, 'Lunch', 'Western', 4, '2024-10-29'),
('오삼불고기', 1000, 'Breakfast', 'HotPot', 24, '2024-10-30'),
('돈코츠 마라탕', 5000, 'Lunch', 'HotPot', 30, '2024-10-30'),
('참치마요덮밥', 5000, 'Lunch', 'RiceBowl', 7, '2024-10-30'),
('불고기크림파스타꽈배기도너츠', 5000, 'Lunch', 'Western', 17, '2024-10-30');

INSERT INTO `ORDER` (OrderedAt, TotalCost)
VALUES 
(NOW(), 10000),
(NOW() - INTERVAL 1 DAY, 20000),
(NOW() - INTERVAL 2 DAY, 15000);

INSERT INTO ORDER_ITEM (OrderID, IngredientID, Quantity, TotalCost, Status)
VALUES 
(1, 1, 5, 150, 'Preparing'),
(1, 2, 10, 500, 'Shipping'),
(2, 3, 20, 1000, 'Delivered');

INSERT INTO STOCK (StockQuantity, ExpiryDate, IngredientID)
VALUES 
(100, '2024-12-01', 1),
(200, '2024-12-15', 2),
(150, '2025-01-01', 3);
